Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / f58d196055ef5c2d4ab110c7c961b61f251cb3e1
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17519206367

**Plan (last ~500 lines):**
```
module.karpenter.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_region.current: Reading...
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
data.aws_availability_zones.available: Reading...
aws_iam_service_linked_role.autoscaling: Refreshing state... [id=arn:aws:iam::298367968222:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a2ec5d5f7544f642]
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20250906191807038200000001]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=cilium-cluster-20250906191807368200000002]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=cilium-nodes]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::298367968222:policy/cilium-cluster-20250906191807392800000003]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=298367968222]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::298367968222:user/cloud_user]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=298367968222]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cilium-cluster-20250906191807368200000002-2025090619180788210000000a]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cilium-cluster-20250906191807368200000002-20250906191807761900000004]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cilium-cluster-20250906191807368200000002-20250906191807795800000006]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2885340831]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-nodes-20250906191807796800000007]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-nodes-20250906191807854600000008]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-nodes-20250906191807866400000009]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-nodes-20250906191807778900000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=cilium-nodes]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=e5f2f414-0743-41e9-b45e-503184b0be27]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cilium]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::298367968222:policy/cilium-cluster-ClusterEncryption20250906191837200900000011]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cilium-cluster-20250906191807368200000002-20250906191837590700000012]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ce39476d6986c8a2]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0c2196a3b37a05021]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04faeb53f54c196c1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-020c17f2d7d5de4c5]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0466c230e057824fc]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-02d871aa737442fdb]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-07d6b4d8c5c664ac6]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c31574925a56e150]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-03cce11d22ae56b2e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02c462b612c80e8c6]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0f91dc80b6555020a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a4add50b15e225c6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca8d656ae39e3967]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0217c57a178ff79f2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04a9f2bd1556caae0]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b7e68c540ce460c8]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-06150ae156aa1518c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09e00742bdc368556]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e0561ca49f99cc1b]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0472dfceab2f6e026]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-064a409d291562366]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0abf5362b1f7aa826]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a4add50b15e225c61080289494]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1630307409]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2592875531]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4264368064]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1285949562]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-1171457965]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1631083201]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-1398403168]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1777413119]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2679892732]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2312116266]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1083342780]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3311925550]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1451237543]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a71112a942f90140]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0013a2e6d53319946]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05792d85d0bef5d8d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-058d41b87dd74d340]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03bc1bc2e2e00ec13]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ec8018caf3795813]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a3f1f1200049321e]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=cilium]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02c462b612c80e8c61080289494]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-09-06T19:29:03Z]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-042afc40d7706cac0,GithubRepo]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubOrg"]: Refreshing state... [id=sg-042afc40d7706cac0,GithubOrg]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cilium:arn:aws:iam::298367968222:user/cloud_user]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-042afc40d7706cac0,Cluster]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=570079493545585289]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=cilium:arn:aws:iam::298367968222:role/cilium-nodes]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::298367968222:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0f7310677579347a7]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cilium#arn:aws:iam::298367968222:user/cloud_user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20250906192909540000000015]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=cilium:eks-pod-identity-agent]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250906193452582100000002]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250906193452585700000004]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-a5czibkboh3zooo9x]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250906193452586200000005]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250906193452583100000003]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=cilium]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/298367968222/Karpenter-cilium]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=4140ad41ae80710ecda2f78b69fea5abb6cfe202ebad46fbf9d578bc281a9c36]
module.network.data.aws_caller_identity.current: Reading...
module.network.data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
module.network.data.aws_eks_cluster.this: Reading...
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=cilium]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-2025090619345372290000000a]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-20250906193453717400000009]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-20250906193453492100000007]
module.network.data.aws_eks_cluster.this: Read complete after 0s [id=cilium]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-20250906193453656000000008]
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=1186405853]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/298367968222/Karpenter-cilium]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=3064279249]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250906193452585700000004-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250906193452583100000003-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=4065261163]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250906193452582100000002-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250906193452586200000005-KarpenterInterruptionQueueTarget]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cilium:arn:aws:iam::298367968222:role/cilium]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=3064279249]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::298367968222:policy/KarpenterController-2025090619351931490000000b]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20250906191807038200000001-2025090619351991350000000c]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
aws_eks_addon.coredns: Refreshing state... [id=cilium:coredns]
module.helm.data.aws_caller_identity.current: Reading...
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_region.current: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::298367968222:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::298367968222:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=298367968222]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20250906194512682800000002]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20250906194512729600000003]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20250906194512761400000004]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/default"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              role: cilium
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              tags:
                karpenter.sh/discovery: cilium
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/default"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: default
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                    - t3.small
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.3"
              - chart          = "argo-cd"
              - first_deployed = 1757189610
              - last_deployed  = 1757189610
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file \`server.ingress.enabled\` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the \`configs.params."server.insecure"\` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs = {
                          - params = {
                              - "server.insecure" = true
                            }
                        }
                      - global  = {
                          - domain = "argocd.298367968222.realhandsonlabs.net"
                        }
                      - server  = {
                          - ingress = {
                              - annotations      = {
                                  - "external-dns.alpha.kubernetes.io/hostname"      = "argocd.298367968222.realhandsonlabs.net"
                                  - "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
                              - enabled          = true
                              - extraTls         = [
                                  - {
                                      - hosts = [
                                          - "argocd.298367968222.realhandsonlabs.net",
                                        ]
                                    },
                                ]
                              - ingressClassName = "nginx"
                            }
                        }
                    }
                )
              - version        = "5.51.6"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.13.4"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1757187920
              - last_deployed  = 1757189144
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 2
              - values         = jsonencode(
                    {
                      - clusterName    = "cilium"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::298367968222:role/eks-load-balancer-controller-role"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0a2ec5d5f7544f642"
                    }
                )
              - version        = "1.13.4"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      + set {
          + name  = "enableServiceMutatorWebhook"
          + value = "false"
        }
      + set {
          + name  = "podMutatorWebhookConfig.failurePolicy"
          + value = "Ignore"
        }

        # (6 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
